app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
     flash[:notice] = "Book was successfully created."
     redirect_to book_path(@book)
    else
      @books=Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2022-02-13 19:35:01.310736"], ["updated_at", "2022-02-13 19:35:01.310736"]]
SELECT "books".* FROM "books"